# CannotRemoveGroupMemberConstraintWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..CannotRemoveGroupMemberConstraintWarn Property
BuiltInFailures..::..GroupFailures Class See Also
---
Constraints between group members cannot be removed or excluded from the group.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotRemoveGroupMemberConstraintWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotRemoveGroupMemberConstraintWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotRemoveGroupMemberConstraintWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace